import Link from "next/link";

export default function Polytic() {
  const styles = {
    mb: {
      margin: "10px 0",
    },
    mbH1: {
      marginTop: "50px",
    },
    listUl: {
      paddingLeft: "20px",
    },

    listLi: {
      listStyleType: "disc",
    },
  };

  return (
    <div className="container" style={styles.mbH1}>
      <h1 className="text-h1">Политика конфиденциальности</h1>
      <h2 className="text-h2" style={styles.mb}>
        1. Назначение и область действия документа
      </h2>
      <p className="text16">
        Настоящая Политика в отношении обработки персональных данных (далее –
        Политика) определяет позицию и намерения администрации сайта limaudio.ru
        (далее – Сайт) — ООО "Редирект" (ОГРН: 1151690078055; ИНН: 1660252599;
        контактный телефон:
        <Link style={{ color: "#1C1C1C" }} href="tel:88007700473">
          8 (800) 770-04-73
        </Link>
        ; e-mail:
        <a style={{ color: "#1C1C1C" }} href="mailto:info@limaudio.ru">
          info@limaudio.ru
        </a>
        ) (далее – Оператор) в области обработки и защиты персональных данных
        посетителей сайта limaudio.ru (далее — Пользователи). Политика
        распространяется на персональные данные, полученные как до, так и после
        выражения согласия Пользователя с настоящей Политикой. Политика
        разработана в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ
        «О персональных данных» (далее – ФЗ № 152) и иными нормативными
        правовыми актами Российской Федерации.
      </p>{" "}
      <h2 className="text-h2" style={styles.mb}>
        2. Персональные данные
      </h2>
      <p className="text16">
        2.1. В рамках настоящей Политики под персональными данными понимается
        любая информация, относящаяся к прямо или косвенно определенному или
        определяемому физическому лицу (субъекту персональных данных),
        предоставленная Пользователем на Сайте, включая:{" "}
      </p>{" "}
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>фамилия;</li>
        <li style={styles.listLi}>имя;</li>
        <li style={styles.listLi}>отчество (при наличии);</li>
        <li style={styles.listLi}>адрес электронной почты;</li>
        <li style={styles.listLi}>номер телефона;</li>
        <li style={styles.listLi}>
          данные, получаемые с использованием файлов cookie, в соответствии с
          Условиями и правилами использования cookie, являющимися приложением к
          настоящей Политике;
        </li>
      </ul>
      <p className="text16">
        2.2. Политика распространяется на все персональные данные Пользователей,
        обрабатываемые Оператором с применением средств автоматизации или без
        применения таких средств.
      </p>
      <h2 className="text-h2" style={styles.mb}>
        3. Субъекты персональных данных
      </h2>
      <p className="text16">
        3.1. Оператор обрабатывает персональные данные следующих категорий
        Пользователей:
      </p>
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>сотрудников Оператора;</li>
        <li style={styles.listLi}>субъектов;</li>
        <li style={styles.listLi}>
          с которыми заключены договоры гражданско-правового характера;
        </li>{" "}
        <li style={styles.listLi}>
          законных представителей сторон договоров гражданско-правового;
          характера
        </li>
        <li style={styles.listLi}>зарегистрированных Пользователей Сайта;</li>
        <li style={styles.listLi}>незарегистрированных Пользователей Сайта;</li>
      </ul>
      <h2 className="text-h2" style={styles.mb}>
        4. Принципы и условия обработки персональных данных
      </h2>
      <p className="text16">
        4.1. Оператор обеспечивает безопасность персональных данных, защищая их
        от неправомерного или случайного доступа, уничтожения, изменения,
        блокирования, копирования, предоставления, распространения, а также иных
        неправомерных действий. <br />
        4.2. Обработка персональных данных осуществляется в соответствии с
        Конституцией Российской Федерации, ФЗ № 152, подзаконными актами,
        включая постановления Правительства РФ, приказами Роскомнадзора, а также
        иными нормативными правовыми актами, регулирующими порядок обработки
        персональных данных. <br />
        4.3. Оператор обрабатывает персональные данные Пользователей для
        предоставления услуг, заключения и исполнения договоров, а также в иных
        целях, предусмотренных настоящей Политикой. <br />
        4.4. Обработка персональных данных осуществляется при наличии одного из
        следующих условий: - Пользователь дал согласие на обработку своих
        персональных данных, подтвержденное через веб-формы на Сайте или фактом
        отправки данных; - обработка необходима для исполнения договора,
        стороной, выгодоприобретателем или поручителем которого является
        Пользователь; - обработка необходима для осуществления прав и законных
        интересов Оператора или третьих лиц при условии, что не нарушаются права
        и свободы Пользователя; - осуществляется обработка персональных данных,
        доступ к которым предоставлен Пользователем неограниченному кругу лиц
        или по его просьбе; - обработка персональных данных осуществляется в
        соответствии с требованиями законодательства Российской Федерации.
        <br />
        4.5. Оператор вправе поручить обработку персональных данных третьим
        лицам на основании договора, содержащего обязательства по соблюдению
        принципов и правил обработки персональных данных, предусмотренных ФЗ №
        152. <br />
        4.6. Передача персональных данных осуществляется только в случаях,
        предусмотренных законодательством Российской Федерации, с соблюдением
        требований конфиденциальности. <br />
        4.7. Для информационного обеспечения деятельности Сайта могут
        создаваться общедоступные источники персональных данных (например,
        справочники), включающие данные Пользователей, с которыми заключены
        договоры гражданско-правового характера, такие как наименование
        юридического лица, ФИО представителя, должность, контактные данные.
        <br />
        4.8. Предоставляя персональные данные при регистрации или использовании
        Сайта, Пользователь дает согласие на их обработку в соответствии с
        настоящей Политикой. Несогласие с Политикой является основанием для
        прекращения использования Сайта. <br />
        4.9. Персональные данные предоставляются Пользователем добровольно и
        считаются достоверными до доказательства обратного. Пользователь несет
        ответственность за предоставление недостоверных или неактуальных данных.
        <br />
        4.10. Оператор принимает организационные и технические меры для защиты
        персональных данных, включая использование лицензионного программного
        обеспечения, антивирусных средств, регулярное обновление программ,
        разработку правил доступа, регистрацию и учет действий с персональными
        данными. <br />
        4.11. Для координации мер по обеспечению безопасности персональных
        данных назначены ответственные лица.
      </p>
      <h2 className="text-h2" style={styles.mb}>
        5. Цели сбора и обработки персональных данных. Сроки хранения
      </h2>
      <p className="text16">
        5.1. Персональные данные обрабатываются в следующих целях: <br />
      </p>
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>
          идентификация Пользователя при заключении и исполнении договоров;
        </li>
        <li style={styles.listLi}>предоставление услуг Пользователям;</li>
        <li style={styles.listLi}>
          связь с Пользователем, включая отправку уведомлений, запросов,
          информации, связанных с оказанием услуг;
        </li>
        <li style={styles.listLi}>
          продвижение услуг Сайта путем прямых контактов с Пользователем;
        </li>
        <li style={styles.listLi}>
          улучшение качества работы Сайта, анализ его удобства и эффективности;
        </li>
        <li style={styles.listLi}>
          иные цели, не противоречащие законодательству Российской Федерации;
        </li>
      </ul>
      <br />
      <p className="text16">
        5.2. Персональные данные хранятся в течение срока, необходимого для
        достижения целей обработки, но не дольше сроков, установленных
        законодательством Российской Федерации. Согласие на обработку
        персональных данных действует бессрочно и может быть отозвано
        Пользователем путем направления заявления на e-mail:{" "}
        <a style={{ color: "#1C1C1C" }} href="mailto:info@limaudio.ru">
          info@limaudio.ru
        </a>
        с указанием данных, предусмотренных ст. 14 ФЗ № 152.
      </p>
      <br />
      <h2 className="text-h2" style={styles.mb}>
        6. Права субъекта персональных данных
      </h2>
      <p className="text16">
        6.1. Пользователь имеет право на получение информации об обработке своих
        персональных данных, включая: <br />
      </p>
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>
          подтверждение факта обработки персональных данных;
        </li>
        <li style={styles.listLi}>правовые основания и цели обработки;</li>
        <li style={styles.listLi}>
          способы обработки, применяемые Оператором;
        </li>
        <li style={styles.listLi}>
          наименование и адрес Оператора, сведения о лицах, имеющих доступ к
          данным
        </li>
        <li style={styles.listLi}>
          перечень обрабатываемых персональных данных и источник их получения
        </li>
        <li style={styles.listLi}>сроки обработки и хранения данных;</li>
        <li style={styles.listLi}>
          порядок реализации прав, предусмотренных ФЗ № 152; - информацию о
          трансграничной передаче данных (при наличии);
        </li>
        <li style={styles.listLi}>
          сведения о лицах, обрабатывающих данные по поручению Оператора.
        </li>
      </ul>
      <br />
      <h2 className="text-h2" style={styles.mb}>
        6.2. Пользователь вправе:
        <ul className="text16" style={styles.listUl}>
          <li style={styles.listLi}>
            вносить изменения или дополнять свои персональные данные;
          </li>
          <li style={styles.listLi}>
            требовать удаления данных или отозвать согласие на их обработку,
            направив запрос на e-mail:
            <a style={{ color: "#1C1C1C" }} href="mailto:info@limaudio.ru">
              info@limaudio.ru
            </a>
          </li>
        </ul>
      </h2>
      <h2 className="text-h2" style={styles.mb}>
        7. Прочие условия
      </h2>
      <p className="text16">
        7.1. Политика вступает в силу с момента публикации на Сайте и
        обязательна для всех Пользователей.
        <br />
        7.2. Оператор вправе вносить изменения в Политику в одностороннем
        порядке. Новая редакция вступает в силу с момента размещения на Сайте,
        если иное не предусмотрено. <br />
        7.3. Политика доступна на Сайте для всех Пользователей. <br />
        7.4. Лица, нарушающие нормы обработки и защиты персональных данных,
        несут ответственность в соответствии с законодательством Российской
        Федерации.
        <br />
      </p>
      <h2 className="text-h2" style={styles.mb}>
        Приложение. Условия и правила использования файлов cookie
      </h2>
      <p className="text16">
        1. Файлы cookie – это небольшие текстовые файлы, используемые для
        хранения информации о действиях пользователей в веб-браузерах. Они
        применяются для идентификации и хранения данных на устройствах
        Пользователей. В настоящей Политике под cookie понимаются также иные
        аналогичные технологии. <br />
        2. Cookie используются для:
      </p>
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>
          настройки Сайта в соответствии с предпочтениями Пользователя;
        </li>
        <li style={styles.listLi}>
          сбора статистики для анализа поведения Пользователей и улучшения Сайта
        </li>
        <li style={styles.listLi}>
          поддержания сеанса Пользователя после входа в личный кабинет.
        </li>
      </ul>
      <p className="text16">3. Сайт использует:</p>
      <ul className="text16" style={styles.listUl}>
        <li style={styles.listLi}>
          сессионные cookie, удаляемые после закрытия браузера;
        </li>
        <li style={styles.listLi}>
          постоянные cookie, сохраняющиеся до истечения срока действия или
          удаления Пользователем;
        </li>
        <li style={styles.listLi}>
          cookie для обеспечения безопасности (например, для предотвращения
          нарушений аутентификации);
        </li>
        <li style={styles.listLi}>
          функциональные cookie для сохранения настроек интерфейса (язык, размер
          шрифта и т.д.).
        </li>
      </ul>
      <p className="text16">
        4. Пользователь может настроить браузер для блокировки cookie или
        уведомления об их использовании. Подробности доступны в настройках
        браузера. <br />
        5. Ограничение использования cookie может повлиять на функциональность
        Сайта. <br />
        6. Cookie, установленные Сайтом, могут использоваться партнерами
        Оператора, которые обязаны соблюдать требования ФЗ № 152. Cookie
        позволяют анализировать предпочтения Пользователей, улучшать
        функциональность Сайта и предоставлять актуальные услуги.
      </p>
    </div>
  );
}
